{
	"ru" : {
	 	"1": {
			"title": "Дан произвольный список. Как его представить его в обратном порядке?",
			"variants": ["my_list[:-1]", "my_list[-1::]", "my_list[::-1]", "my_list[0:-1]", "my_list[-1]"],
			"flags": [0, 0, 1, 0, 0]
		},
		"2": {
 			"title": "Костя написал программу на языке Python. Код программы представлен ниже.Помогите Косте найти и исправить ошибку в коде. Для этого выберите вариант ответа, который содержит исправленный код.",
 			"variants": ["print('Hi')", "if a == 12: print('Yes')", "a = 10", "ele: print('I! GuGlO')", "В коде нет ошибок"],
 			"flags": [0, 1, 0, 0, 0]
 		},
		"3": {
 			"title": "Катя создаёт класс Apple, принимающий 2 аргумента при инициализации (отвечающие за количество и цвет яблок (красный, жёлтый, зелёный)). В этом классе Катя реализует метод show_money(), который к количеству яблок прибавляет 10, но если яблок больше 50 и они красные, то цена яблок равна произведению их количества на 10. Сколько будут стоить 60 красных и 30 жёлтых яблок?",
 			"variants": ["600, 40", "500, 50", "600, 60", "600, 20"],
 			"flags": [1, 0, 0, 0, 0]
 		}
		"4": {
 			"title": "На основании трёх исходных множеств (передаются в качестве аргументов функции) необходимо создать функцию, которая будет возвращать либо симметричную разность, либо просто разность (если дополнительный аргумент функции simm имеет значение False) приведённых объектов в порядке: 1-ое, 2-ое и 3-е множество. Что получится при использовании следующих значений для функции с и без симметрии?",
 			"variants": ["{3, 4, 7, 10}, {10}", "{1, 4, 7, 20}, {30}", "{3, 14, 11, 2}, {20}", "{13, 14, 17, 20}, {20}", "{23, 24, 27, 30}, {40}"],
 			"flags": [0, 0, 0, 1, 0]
 		},
		"5": {
 			"title": "Создайте функцию infinite (lst, tries), которая будет проходиться по элементам списка lst (целые числа) заданное количество раз (tries) циклически. Один раз - один элемент списка. После вывода последнего значения последовательности процедура начнется с самого начала. Например, если в списке 2 элемента, а функция получила значение 3, то сначала выведется первый объект, потом последний, а потом опять первый. Что получится при значениях на картинке. Результат работы функции представьте в виде строки, состоящей из tries количества символов",
 			"variants": ["221582115, 7912791279", "211582115, 7922791279", "211582115, 7912792279", "211582115, 7912791279", "211582115, 7932791279"],
 			"flags": [0, 0, 0, 1, 0]
 		}
		
	}
}
